// Напишите функцию, которая принимает массив чисел (целые числа для тестов) и целевое число. Он должен найти в массиве два разных элемента, которые при суммировании дают целевое значение. Индексы этих элементов затем должны быть возвращены в виде кортежа/списка (в зависимости от вашего языка) следующим образом: (index1, index2).

// Для целей этого ката некоторые тесты могут иметь несколько ответов; любые действительные решения будут приняты.

// Ввод всегда будет действительным (числа будут представлять собой массив длиной 2 или больше, и все элементы будут числами; цель всегда будет суммой двух разных элементов из этого массива).

// На основе: http://oj.leetcode.com/problems/two-sum/

// twoSum([1, 2, 3], 4) // returns [0, 2] or [2, 0]