// Функция RGB неполная. Завершите его так, чтобы передача десятичных значений RGB приводила к возврату шестнадцатеричного представления. Допустимые десятичные значения для RGB: 0–255. Любые значения, выходящие за пределы этого диапазона, должны быть округлены до ближайшего допустимого значения.

// Примечание. Ваш ответ всегда должен состоять из 6 символов, сокращение из 3 здесь не подойдет.

// Примеры (вход --> вывод):
// 255, 255, 255 --> "FFFFFF"
// 255, 255, 300 --> "FFFFFF"
// 0, 0, 0       --> "000000"
// 148, 0, 211   --> "9400D3"